# Завдання 2. Варіант 7

# Реалізувати функцію, яка виконує операції над списками – задану за варіантом та друк списку на екран. Повернення 
# списку, що сформований з початкового списку, але не містить повторів (залишається лише перший з однакових елементів).

def remove_duplicates():
    lst = list(map(int, input('Введіть елементи списку через пробіл: ').split()))

    unique_lst = []
    for item in lst:
        if item not in unique_lst:
            unique_lst.append(item)

    print("Список без повторів:", unique_lst)


remove_duplicates()
