# Завдання 1. Варіант 7

#  Реалізувати одновимірний масив, довжину масива та сам масив користувач має ввести з клавіатури.
#  Дано одномірний масив, що складається з N цілочисельних елементів. Масив користувач має ввести з клавіатури.
#  Вивести додатні елементи на екран. Масив користувач має ввести з клавіатури.

N = int(input("Введіть кількість елементів у масиві: "))

arr = []
for i in range(N):
    x = int(input(f"Введіть елемент {i + 1}: "))
    arr.append(x)

for x in arr:
    if x > 0:
        print(x)
