# Завдання 1. Варіант 7

# Задано дані про кількість опадів, які випали за кожен день місяця, і про температуру повітря в ці дні. Скласти
# програму, що визначає, яка кількість опадів випала у вигляді снігу і яка – у вигляді дощу (вважати, що дощ іде,
# якщо температура повітря вище 0° С).

weather_data = {
    1: [7, -1],
    2: [6, 1],
    3: [0, 4],
    4: [4, -3],
    5: [15, 3],
    6: [5, -2],
    7: [0, 5],
}

rain = 0
snow = 0

for day, data in weather_data.items():
    precipitation, temperature = data
    if temperature > 0:
        rain += precipitation
    else:
        snow += precipitation

print(f"Кількість опадів у вигляді дощу: {rain} мм")
print(f"Кількість опадів у вигляді снігу: {snow} мм")