# Завдання 1. Варіант 7

# Присвойте змінній довільний рядок в та отримайте з неї наступні зрізи, якщо довжина слова достатня для виконання операції зрізу.
# Отримати послідовність символів від 6-го символа з кінця і до 2-го символа з кінця (2-й символ з кінця не включається)

s = str(input("Введіть довільний рядок (довший за 6 символів): "))

while len(s) < 6:
    s = str(input("Введіть ще раз слово, так як воно менше 6 символів: "))

print("Послідовність символів від 6-го символа з кінця і до 2-го символа з кінця: ", s[-6:-2])
